Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: གནོད་པ་ཡང་དག་མ་ཡིན་བརྟགས་པ་ཡི། །འདོད་ཆགས་ཞེ་སྡང་དག་གིས་འགྲོ་བ་གདུངས།
en: “Beings are scorched by attachment and anger, Yet they are falsely imputed—such ills are not for real.

source: །སྙིང་རྗེའི་སྤྲིན་ལས་ཞི་བ་བསིལ་བའི་ཆུ། །འདྲེན་པ་བདུད་རྩི་རྒྱུན་ནི་རབ་ཏུ་ཕོབ།
en: Guide, release the stream of nectar, The cooling waters of peace from the cloud of compassion.

source: །བྱང་ཆུབ་དམ་པ་ཡང་དག་ཐོབ་ནས་ནི།
en: “ ‘Once I attain supreme awakening,

source: །འཕགས་པའི་ནོར་གྱིས་སྲོག་ཆགས་བསྡུའོ་ཞེས།
en: I will gather noble wealth for beings.’

source: །མཁས་པ་ཁྱོད་ཀྱིས་གང་གི་ཆེད་ཀྱི་ཕྱིར།
en: Skillful One, saying this you sought out supreme awakening,

source: །བསྐལ་པ་བྱེ་བ་མང་པོར་སྦྱིན་པ་བྱིན།
en: And for many millions of eons you made offerings to the learned.

source: །སྔོན་གྱི་སྤྱོད་དེ་རྗེས་སུ་དྲན་གྱིས་ཏེ།
en: “Remember your previous actions!

source: །འཕགས་པའི་ནོར་གྱིས་དམན་དབུལ་སྡུག་བསྔལ་ལ། །སེམས་ཅན་ཁ་ལོ་སྒྱུར་བ་མ་གཡེལ་བར།
en: Charioteer, do not forget to bring this noble wealth To those who are depressed, poor, and suffering.

source: །འཕགས་པའི་ནོར་གྱིས་དེ་དག་བསྡུ་བར་གྱིས། །
en: Gather them with your noble wealth.

source: ངན་སོང་ས་ཡི་ལམ་ནི་བཅད་པ་དང་། །མཐོ་རིས་བདུད་རྩིའི་སྒོ་མོ་མཆོག་དེ་ནི།
en: “ ‘I will show millions of beings The perfect gate to the nectar of the higher realms.’

source: །སེམས་ཅན་བྱེ་བ་མང་ལ་བསྟན་ཞེས་ཏེ། །ཁྱོད་ཀྱིས་རྟག་ཏུ་ཚུལ་ཁྲིམས་ཤིན་ཏུ་བསྲུངས།
en: Saying this, you guarded your discipline well In order to block the way to the three lower realms.

source: །ཚུལ་ཁྲིམས་ལྡན་པས་བསམས་པ་འགྲུབ་འགྱུར་གྱིས།
en: “Keep your discipline and fulfill your wishes;

source: །སྔོན་གྱི་སྤྱོད་དེ་རྗེས་སུ་དྲན་གྱིས་ལ།
en: Remember your past actions.

source: །ངན་སོང་གསུམ་པོའི་ས་ཡི་སྒོ་ཆོད་དེ།
en: Close the gates to the three lower realms,

source: །མཐོ་རིས་བདུད་རྩིའི་སྒོ་ནི་དབྱེ་བར་གྱིས།
en: And open the gates to the nectar of the higher realms.

source: །སྲོག་ཆགས་རྣམས་ཀྱི་ཁོང་ཁྲོ་ཁྲོ་གཞིལ་དང་། །སྲིད་པའི་མཚོ་ལས་སེམས་ཅན་བསྒྲལ་བྱས་ཏེ།
en: “ ‘I will put up with beings’ hostility and anger, And liberate everyone from the ocean of existence.

source: །ཞི་བདེ་རིམས་ནད་མེད་ལ་དགོད་དོ་ཞེས།
en: I will establish them in peace and happiness without disease.’

source: །ཁྱོད་ཀྱིས་རྟག་ཏུ་བཟོད་པ་ཤིན་ཏུ་བསྒོམས།
en: Saying this, you have always trained in forbearance.

source: །སྔོན་གྱི་སྤྱོད་དེ་རྗེས་སུ་དྲན་གྱིས་ཏེ། །དགྲ་དང་གནོད་སེམས་འཚེ་བས་དཀྲུགས་པ་ཡི། །འཚེ་བ་སྤྱོད་པ་ཡལ་བར་མ་དོར་བར།
en: “Remember your previous actions! Do not abandon those who engage in harmful actions, Due to being disturbed by animosity, ill will, and harmful wishes.

source: །འགྲོ་བ་འདི་དག་བཟོད་པའི་ས་ལ་ཁོད།
en: You said: ‘I will bring those beings to the stage of forbearance.

source: །ཆོས་ཀྱི་གྲུ་ནི་ལེགས་པར་སྦྱར་བྱས་ལ།
en: “ ‘I will prepare the ship of Dharma,

source: །སྲིད་པའི་མཚོ་ལས་འགྲོ་བ་རྣམས་བསྒྲལ་ཏེ།
en: Deliver beings from the ocean of existence,

source: །གང་གི་དོན་དུ་ཁྱོད་ཀྱིས་བརྩོན་འགྲུས་བརྟེན།
en: Saying this, you have relied on diligence to achieve that.

source: །འགྲོ་བ་ཆུ་བོ་བཞི་ཡིས་ཁྱེར་གྱུར་པ།
en: The four rivers carry beings away;

source: །སེམས་ཅན་མགོན་མེད་པ་དག་བརྩོན་སྟོབས་དང་། །བརྟུལ་བའི་ཤུགས་ཀྱིས་མྱུར་དུ་འདི་དག་ཐོན།
en: Quick, rescue those beings that have no guide, Through the power of your diligence and the strength of your discipline. “ ‘I will establish on the noble path

source: །དབང་པོ་འཁྲུལ་དང་ཕལ་པའི་དབང་པོ་དང་། །སྤྲེའུ་འདྲའི་སེམས་ལས་ཞི་གནས་ངས་དགོད་ཅེས།
en: Those beings that have confused faculties and suffer from monkey-like thoughts.’

source: །འདྲེན་པ་ཁྱོད་ཀྱིས་གང་གི་ཆེད་ཀྱི་ཕྱིར།
en: O Gentle One, to accomplish that,

source: །ཉོན་མོངས་གཞིལ་བའི་བསམ་གཏན་བསྒོམས་གྱུར་པ།
en: You have trained in concentration that expels disturbing emotions.

source: །སྔོན་གྱི་སྤྱོད་དེ་རྗེས་སུ་དྲན་གྱིས་ཏེ། །ཉོན་མོངས་དྲ་བས་དཀྲུགས་པར་གྱུར་པ་ཡི། །འགྲོ་ལ་མ་གཡེལ་ཉོན་མོངས་གཙེས་པ་ལས།
en: “Remember your previous actions! Do not abandon those afflicted beings Who are agitated by the web of disturbing emotions.

source: །བསམ་གཏན་མཆོག་ལ་སྐྱེ་དགུ་འདི་དག་ཁོད།
en: Establish these beings in one-pointed concentration.

source: །གཏི་མུག་མ་རིག་མུན་པས་བསྒྲིབས་པ་ཡི།
en: “ ‘I will give beings who are veiled by the darkness of delusion and ignorance

source: །འགྲོ་ལ་ཆོས་བརྒྱ་མང་པོ་མཐོང་བྱེད་པ།
en: A vision of many hundred doors to the Dharma.

source: །ཡང་དག་མཐོང་བའི་མིག་ནི་སྦྱིན་ནོ་ཞེས།
en: I will give them eyes that can see reality.’

source: །ཁྱོད་ཀྱིས་སྔོན་ཆད་ཤེས་རབ་ཤིན་ཏུ་བསྒོམས།
en: Saying this, you have meditated on knowledge.

source: །སྔོན་གྱིས་སྤྱོད་དེ་རྗེས་སུ་དྲན་གྱིས་ལ།
en: “Remember your previous actions!

source: །འགྲོ་ལ་ཤེས་རབ་དམ་པ་འོད་བཟང་བ།
en: You must give the excellent light of sacred knowledge,

source: །ཆོས་མིག་དྲི་མེད་ཉོན་མོངས་མེད་པ་བྱིན།
en: The eye of Dharma, which is stainless and impeccable.”

source: །བུད་མེད་རྣམས་ཀྱི་སིལ་སྙན་གླུ་དབྱངས་ལས། །ཚིགས་སུ་བཅད་པ་འདི་འདྲ་འདི་བྱུང་སྟེ།
en: Verses like this emerge from The sounds of the women’s instruments.

source: །དེ་ཐོས་ནས་ནི་རྒྱགས་པ་རྣམ་སྤངས་ནས།
en: Hearing them, all the Bodhisattva’s sleepiness vanishes

source: །བྱང་ཆུབ་དམ་པ་མཆོག་ཏུ་སེམས་བཏང་ངོ་།
en: And he sets his mind on perfect and supreme awakening.

source: །དགེ་སློང་དག་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་བཙུན་མོའི་འཁོར་གྱི་ནང་ན་འདུག་པའི་ཚེ་ཡང་ཆོས་མཉན་པ་དང་བྲལ་བར་མ་གྱུར་ཏོ།
en: Monks, in this way, even as the Bodhisattva was with his retinue of consorts, he could not avoid hearing the sound of the Dharma.

source: །ཆོས་ཡིད་ལ་བྱེད་པ་དང་བྲལ་བར་མ་གྱུར་ཏོ།
en: He could not avoid thinking about the Dharma.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དགེ་སློང་དག་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཡུན་རིང་པོ་ནས་ཆོས་དང་ཆོས་སྨྲ་བ་རྣམས་ལ་གུས་པ་དང་བཅས་པར་གྱུར་ཅིང་།
en: Monks, this was because for so long the Bodhisattva had paid his respects to the Dharma and to those who teach the Dharma.

source: བསམ་པ་ཐག་པ་ནས་ཆོས་དོན་དུ་གཉེར་བ། ཆོས་འདོད་པ། ཆོས་ཀྱི་ཀུན་དགའ་ལ་དགའ་ཞིང་མོས་པར་གྱུར་པ།
en: From the innermost core of his being, he strove toward the Dharma, wished for the Dharma, and his only delight was in the Dharma.

source: ཆོས་ཚོལ་བས་ངོམས་མི་ཤེས་པ།
en: As he searched for the Dharma, he was insatiable.

source: ཇི་ལྟར་ཐོས་པའི་ཆོས་ཡང་དག་པར་སྟོན་པ།
en: He taught the Dharma just as he had heard it.

source: བླ་ན་མེད་པའི་ཆོས་ཆེན་པོའི་སྦྱིན་བདག་ཏུ་གྱུར་པ།
en: He was a master of generosity in bestowing the gift of the unexcelled great Dharma.

source: ཟང་ཟིང་མེད་པར་ཆོས་སྟོན་པ།
en: He taught the Dharma without seeking rewards.

source: ཆོས་སྦྱིན་པ་ལ་སེར་སྣ་མེད་པ།
en: He was without any stinginess when it came to teaching the Dharma.

source: ཆོས་ལ་སློབ་དཔོན་གྱི་དཔེ་མཁྱུད་དང་བྲལ་བ།
en: Regarding the Dharma, he never held back anything as a teacher.

source: ཆོས་ཀྱི་རྗེས་སུ་འཐུན་པའི་ཆོས་སྒྲུབ་པ།
en: He practiced the Dharma that he taught.

source: ཆོས་ལ་ནན་ཏན་བྱེད་པ་ལ་དཔའ་བ།
en: He was brave in making the Dharma manifest.

source: ཆོས་ལ་གནས་སུ་འཛིན་པ། ཆོས་ལ་སྐྱབས་སུ་འཛིན་པ། ཆོས་ལ་དཔུང་གཉེན་དུ་འཛིན་པ། ཆོས་ལ་རྟོན་པ།
en: He found his home in the Dharma, his protection in the Dharma, and his refuge in the Dharma. His point of reference was the Dharma, and his ultimate resort was the Dharma.

source: ཆོས་ལ་ངེས་པར་སེམས་པའི་བཟོད་པས་ངེས་པར་བྱུང་བ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱད་པ་སྟེ། ཐབས་ལ་མཁས་པས་རྟོགས་པར་ཁོང་དུ་ཆུད་པ་ཡིན་ནོ།
en: With the Dharma as his object of meditation, proficient in forbearance, he practiced the perfection of knowledge and attained skillful means.

source: །དགེ་སློང་དག་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཐབས་མཁས་པ་ཆེན་པོས་རྣམ་པར་རྩེ་ཞིང་བཙུན་མོའི་འཁོར་ཐམས་ཅད་ཀྱི་མོས་པ་ཇི་ལྟ་བ་བཞིན་དུ་སྤྱོད་ལམ་ནི་བསྟན།
en: Monks, the Bodhisattva demonstrated, with a playful mastery of his great skillful means, the actions conforming to the wishes of his entire retinue of consorts.

source: སྔོན་གྱི་བྱང་ཆུབ་སེམས་དཔའ་འཇིག་རྟེན་གྱི་ཡུལ་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་པ་རྣམས་ཀྱི་འཇིག་རྟེན་དང་འཐུན་པར་བྱ་བའི་ཆོས་ཉིད་དང་འཐུན་པར་ནི་བྱས།
en: He was acting in conformity with the bodhisattvas of the past who, while being beyond the world, acted in worldly ways.

source: ཡུན་རིང་པོ་ནས་འདོད་པའི་སྐྱོན་ཤིན་ཏུ་རྟོགས་པ་ཡིན་ཡང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་དབང་གིས་འདོད་པའི་ལོངས་སྤྱོད་ནི་ཀུན་ཏུ་བསྟན།
en: Since the Bodhisattva had long ago realized the shortcomings of desire, he now demonstrated sensual enjoyment, without himself wanting it, simply in order to ripen others.

source: དགེ་བའི་རྩ་བ་དཔག་ཏུ་མེད་པ་བསགས་པའི་བསོད་ནམས་ཀྱི་སྟོབས་ཀྱི་ཚོགས་ཀྱི་ཁྱད་པར་གྱིས་འཇིག་རྟེན་གྱི་དབང་དུ་བྱ་བ་མཚུངས་པ་མེད་པ་ནི་ཀུན་ཏུ་བསྟན།
en: By the unique power of the accumulation of merit, gathered through limitless roots of virtue, he demonstrated the qualities of the ruler of the world.

source: ལྷའི་དང་མིའི་ལས་ཤིན་ཏུ་འདས་པ་སྙིང་པོ་དང་ལྡན་ཞིང་རྒྱ་ཆེ་ལ། རྣམ་པ་ཐ་དད་པ་སྣ་ཚོགས་ཀྱི་གཟུགས་དང་། སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་མཆོག་ཏུ་དགའ་བ་ཉམས་དགའ་བའི་འདོད་པའི་དགའ་བའི་བདེ་བ་ནི་བསྟན།
en: He demonstrated a complete enjoyment of the delightful forms, sounds, smells, tastes, and textures that went far beyond anything known to gods and humans in terms of quality and extent.

source: འདོད་པའི་དགའ་བའི་ཡུལ་ཐམས་ཅད་ལ་འཛིན་པ་མེད་པར་རང་གི་སེམས་ལ་དབང་བསྒྱུར་བ་ནི་བསྟན།
en: He demonstrated a mastery of mind, which was free from attachment to any of his delightful maidens of pleasure.

source: སྔོན་གྱི་སྨོན་ལམ་གྱི་སྟོབས་ཀྱིས་གྲོགས་སུ་གྱུར་པ། དགེ་བའི་རྩ་བ་བསགས་པའི་སེམས་ཅན་རྣམས་ནི་མཚུངས་པར་གནས་པས་ཡོངས་སུ་སྨིན་པར་བྱས་ནས།
en: He ripened those who were now in his company as friends, due to the power of their previous aspirations and their accumulated roots of virtue.

source: འཇིག་རྟེན་གྱི་ཀུན་ནས་ཉོན་མོངས་པའི་དྲི་མ་ཐམས་ཅད་ཀྱིས་ནི་སེམས་ལ་ཀུན་ནས་ཉོན་མོངས་པ་མེད་པར་བཙུན་མོའི་འཁོར་གྱི་ནང་ན་གནས་ཏེ།
en: As such he was able to stay among the consorts without ever being disturbed by the stains of worldly emotions.

source: ཇི་ལྟར་མགྲོན་དུ་གཉེར་བའི་སེམས་ཅན་གྱི་ཁམས་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་དུས་ལ་ལྟ་ཞིང་། དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་ཤིན་ཏུ་རྒྱ་ཆེར་སྔོན་གྱི་དམ་བཅས་པ་རྗེས་སུ་དྲན་ནོ།
en: While watching for the time to ripen the potential in those who were around him, the Bodhisattva kept his former promise acutely in mind.

source: །སངས་རྒྱས་དང་ཆོས་ཀྱང་མངོན་དུ་བྱེད་དོ། །སྨོན་ལམ་གྱི་སྟོབས་ཀྱང་མངོན་པར་སྒྲུབ་བོ།
en: He actualized the Buddha and the Dharma and perfected the power of aspiration.

source: །སེམས་ཅན་རྣམས་ལ་ཡང་སྙིང་རྗེ་ཆེན་པོ་གཏོང་ངོ་། །སེམས་ཅན་རབ་ཏུ་ཐར་བར་བྱ་བར་ཡང་སེམས་སོ།
en: For sentient beings he felt great compassion and kept their complete freedom foremost in his mind.

source: །འབྱོར་པ་ཐམས་ཅད་ཀྱི་མཐའ་ནི་རྒུད་པ་ཡིན་པར་ཡང་སོ་སོར་རྟོག་གོ།
en: He understood that in the end, any amount of wealth will be used up.

source: །འཁོར་བ་ལ་གནོད་པ་དང་། འཇིགས་པ་མང་པོ་དུ་མ་ཡོད་པར་ཡང་རྟོག་གོ།
en: He understood that saṃsāra is full of many calamities and terrors.

source: །བདུད་དང་ཉེས་པའི་ཞགས་པ་ཡང་ཡང་དག་པར་གཅོད་དོ། །འཁོར་བའི་རྒྱུད་ལས་ཀྱང་བདག་ཉིད་འདའ་བར་བྱེད་དོ། །མྱ་ངན་ལས་འདས་པ་ལ་ཡང་སེམས་ཡང་དག་པར་གཏོད་དོ།། །།
en: He broke free from the evil shackles of Māra, extricated himself from the prison of cyclic existence, and directed his attention to nirvāṇa.

source: འཕགས་པ་རྒྱ་ཆེར་རོལ་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། བམ་པོ་དགུ་པ། དགེ་སློང་དག་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ནི་སྔོན་གྱི་མཐའ་ཉིད་ནས་ཀྱང་འཁོར་བའི་སྐྱོན་ཤིན་ཏུ་རིག་པ་ཡིན།
en: Monks, from the very beginning the Bodhisattva had already understood the many shortcomings of cyclic existence.

source: འདུས་བྱས་ལ་བསམ་པ་ཐག་པ་ནས་དོན་དུ་མི་གཉེར་བ་ཡིན། ཉེ་བར་ལེན་པ་ཡོངས་སུ་འཛིན་པ་ཐམས་ཅད་དོན་དུ་མི་གཉེར་བ་ཡིན།
en: With all his heart, he stopped striving after compounded phenomena, as well as all kinds of grasping and clinging.

source: སངས་རྒྱས་ཀྱི་ཆོས་དོན་དུ་གཉེར་བ་ཡིན།
en: Instead he now only felt interest in the Buddhadharma.

source: མྱ་ངན་ལས་འདས་པ་ལ་མངོན་དུ་ཕྱོགས་པ་ཡིན། འཁོར་བ་ལ་རྒྱབ་ཀྱིས་བལྟས་པ་ཡིན།
en: He turned toward the state of nirvāṇa and turned his back on saṃsāra.

source: དེ་བཞིན་གཤེགས་པའི་སྤྱོད་ཡུལ་ལ་མངོན་དུ་དགའ་བ་ཡིན། བདུད་ཀྱི་སྤྱོད་ཡུལ་དང་མ་འདྲེས་པ་ཡིན།
en: He delighted in the domain of a thus-gone one, because he had separated himself from the domain of Māra.

source: སྲིད་པ་ལ་འབར་བར་སྐྱོན་དུ་མཐོང་བ་ཡིན། ཁམས་གསུམ་པ་ལས་བྱུང་བའི་བསམ་པ་ཅན་ཡིན། འཁོར་བའི་སྐྱོན་དང་ཉེས་དམིགས་དང་འབྱུང་བ་ལ་མཁས་པ་ཡིན།
en: Perceiving the three realms to be ablaze with the shortcomings of existence, his wish was to free himself from them, and he became skilled in removing himself from the shortcomings and faults of cyclic existence.

source: རབ་ཏུ་འབྱུང་བར་འདོད་པ་ཡིན། མངོན་པར་འབྱུང་བའི་བསམ་པ་ཅན་ཡིན། བདེན་པ་ལ་གཞོལ་བ་ཡིན། བདེན་པ་ལ་འབབ་པ་ཡིན།
en: His wish was to become ordained, and his mind was filled with the thought of leaving home.

source: དབེན་པ་ལ་བབ་པ་ཡིན། དགོན་པ་དང་བས་མཐར་མངོན་པར་དགའ་བ་ཡིན།
en: He was determined to live in solitude and delighted in seeking remoteness.

source: རབ་ཏུ་དབེན་པས་རབ་ཏུ་ཞི་བར་འདོད་པ་ཡིན།
en: His wish was to be completely on his own and at peace.

source: བདག་དང་གཞན་ལ་ཕན་པར་ཞུགས་པ་ཡིན། བླ་ན་མེད་པའི་ནན་ཏན་ལ་དཔའ་བ་ཡིན།
en: He strove to be of help, both for himself and for others, and was a hero in unexcelled persistence.

source: འཇིག་རྟེན་གྱི་དོན་དུ་འདོད་པ་ཡིན། ཕན་པར་འདོད་པ་ཡིན། བདེ་བར་འདོད་པ་ཡིན།
en: He wished to be of service to the world and to assist the world.

source: གྲུབ་པ་དང་བདེ་བར་འདོད་པ་ཡིན།
en: He wished happiness and the peace of accomplishment for the world.

source: འཇིག་རྟེན་ལ་སྙིང་བརྩེ་བ་ཅན་ཡིན། ཕན་པར་འདོད་པ་ཅན་ཡིན། བྱམས་པ་ལ་གནས་པ་ཅན་ཡིན།
en: He had compassion for the world and wanted to help.

source: སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་ཡིན། བསྡུ་བའི་དངོས་པོ་ལ་མཁས་པ་ཡིན།
en: He was filled with love, saturated with great compassion, and skilled in the art of attracting others.

source: རྟག་ཏུ་ཡིད་ཡོངས་སུ་མི་སྐྱོ་བ་ཡིན།
en: He was never sad.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་འདུལ་བ་ལ་མཁས་པ་ཡིན།
en: He was skilled in ripening and training others.

source: སེམས་ཅན་ཐམས་ཅད་ལ་བུ་གཅིག་པ་དང་འདྲ་བར་སྡུག་པར་སེམས་པ་ཡིད་ལ་བྱེད་པ་དང་ལྡན་པ་ཡིན།
en: In his heart he harbored the same love toward everyone that one has for one’s only child.

source: དངོས་པོ་ཐམས་ཅད་ལ་མི་ལྟ་བར་ཡོངས་སུ་བཏང་བ་ཡིན།
en: He had abandoned wishes for material objects and paid no attention to them.

source: སྦྱིན་པ་འགེད་པ་ལ་དགའ་བ་ཡིན། ལྷུག་པར་གཏོང་བ་ཡིན། ལག་པ་བརྐྱང་བ་ཡིན། གཏོང་བ་ལ་དཔའ་བ་ཡིན།
en: He delighted in giving and sharing. He never refused, but gave courageously with an open hand.

source: མཆོད་སྦྱིན་བྱས་པ་ཡིན།
en: He made religious offerings.

source: བསོད་ནམས་ཤིན་ཏུ་ཕུན་སུམ་ཚོགས་པ་ཡིན། བསོད་ནམས་ཀྱི་ཡོ་བྱད་ཤིན་ཏུ་བཟུང་བ་ཡིན།
en: He accumulated perfect merit and guarded it well.

source: དྲི་མ་དང་སེར་སྣ་དང་བྲལ་བ་ཡིན། སེམས་ཀུན་ཏུ་མ་བཟུང་བ་ཡིན།
en: Through discipline, he freed himself from any stains or miserliness, and was fully in control of his thoughts.

source: བླ་ན་མེད་པའི་སྦྱིན་བདག་ཆེན་པོ་ཡིན།
en: He was a peerless great benefactor.

source: བྱིན་ནས་ཀྱང་རྣམ་པར་སྨིན་པ་ལ་མི་རེ་བ་ཡིན།
en: Even though he gave, he had no expectation of reward.

source: སྦྱིན་པ་ལ་དཔའ་བ་ཡིན། འདོད་པ་དང་། འདོད་པ་ཆེ་བ་དང་། ཆགས་པ་དང་། ཞེ་སྡང་དང་། རྒྱགས་པ་དང་། ང་རྒྱལ་དང་། གཏི་མུག་དང་། སེར་སྣ་ལ་སོགས་པ་ཉོན་མོངས་པའི་དགྲའི་ཚོགས་ཕྱིར་རྒོལ་བ་ཐམས་ཅད་ཚར་གཅད་པའི་ཕྱིར་མངོན་པར་བྱུང་བ་ཡིན།
en: He was a heroic giver ready to subdue the hostile forces of the entire multitude of disturbing emotions, the primary ones being longing, desire, attachment, anger, haughtiness, pride, delusion, and miserliness.

source: ཐམས་ཅད་མཁྱེན་པའི་སེམས་བསྐྱེད་པའི་རྒྱུན་ལས་མི་གཡོ་བ་ཡིན།
en: He did not lapse from continually giving rise to the state of omniscience.

source: གཏོང་བ་ཆེན་པོའི་སེམས་ཀྱི་གོ་ཆ་ཤིན་ཏུ་བགོས་པ་ཡིན།
en: He was always well protected by an armor of great generosity.

source: འཇིག་རྟེན་ལ་སྙིང་བརྩེ་བ་ཅན་ཡིན། ཕན་པར་འདོད་པ་ཅན་ཡིན། ཡ་ལད་བགོས་པ་ཡིན།
en: He had love and compassion for the world and wished to help.

source: གོ་ཆ་བགོས་པ་ཡིན།
en: His protection and coat of mail was diligence.

source: སེམས་ཅན་རབ་ཏུ་ཐར་བར་བྱ་བ་ལ་དམིགས་པ་ཡིན།
en: His focus was on liberating others.

source: སྙིང་རྗེ་ཆེན་པོའི་སྟོབས་དང་རྣམ་པར་གནོན་པ་དང་། ཕ་རོལ་གནོན་པ་དང་ལྡན་པ་ཡིན།
en: His power was compassion, and his strength was courage.

source: ཕྱིར་མི་ལྡོག་པ་ཡིན།
en: He did not turn back.

source: སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་མཉམ་པ་ཡིན། གཏོང་བའི་ལག་ཆ་ཅན་ཡིན།
en: He had complete impartiality with regard to all beings, and his weapon was generosity.

source: སེམས་ཅན་གྱི་བསམ་པ་དང་རེ་བ་ཇི་ལྟ་བ་བཞིན་དུ་ཚིམ་པར་བྱེད་པ་ཡིན།
en: He was able to satisfy the hopes and wishes of others.

source: བྱང་ཆུབ་ཀྱི་སྣོད་དུ་གྱུར་པ་ཡིན། དུས་དང་ཕྱད་པར་ཆོས་རྟོགས་པ་ཡིན།
en: He was a vessel fit for awakening who continuously realized the Dharma.

source: སྨོན་ལམ་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་པ་ཡིན།
en: He would dedicate his awakening to all beings.

source: རྒྱལ་མཚན་མ་བསྙལ་བ་ཡིན།
en: He did not lower his banner.

source: འཁོར་གསུམ་ཡོངས་སུ་དག་པའི་སྦྱིན་པ་ཡོངས་སུ་གཏོང་བ་དང་ལྡན་པ་ཡིན།
en: When he gave, his generosity was not involved with subject, object, and action.

source: ཡེ་ཤེས་མཆོག་གི་རྡོ་རྗེའི་མཚོན་ཆ་སྲ་བ་དང་ལྡན་པ་ཡིན།
en: He had the sharp vajra weapon of supreme wisdom.

source: ཉོན་མོངས་པའི་ཕྱིར་རྒོལ་བ་ཤིན་ཏུ་ཚར་གཅོད་པ་ཡིན།
en: He conquered all opposing forces of disturbing emotions.

source: ཚུལ་ཁྲིམས་དང་། ཡོན་ཏན་དང་། སྤྱོད་པ་ལ་ཞུགས་པ་ཡིན།
en: He was disciplined, skilled, and behaved correctly.

source: ལུས་དང་། ངག་དང་། ཡིད་ཀྱི་ལས་ཀྱི་མཐའ་ལེགས་པར་བསྲུངས་པ་ཡིན། ཁ་ན་མ་ཐོ་བ་ཕྲ་རབ་ཙམ་ལ་ཡང་འཇིགས་པར་ལྟ་བ་ཡིན།
en: He guarded carefully all his physical, verbal, and mental acts, and exhibited fear of even the smallest unwholesome act.

source: ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པ་ཡིན།
en: His discipline was perfectly pure.

source: དྲི་མ་མེད་ཅིང་དྲི་མ་དང་བྲལ་ལ་དྲི་མ་སྤངས་པའི་སེམས་དང་ལྡན་པ་ཡིན།
en: Mentally he had abandoned all stains and was now clean and spotless.

source: ངན་དུ་སྨྲས་པ་དང་། ངན་དུ་བརྗོད་པའི་ཚིག་གི་ལམ་དང་། བརྒྱད་པ་དང་། སྤྱོ་བ་དང་། སྨད་པ་དང་། བཤུང་བ་དང་། བརྡེག་པ་དང་། བསྡིགས་པ་དང་། བསད་པ་དང་། བཅིང་བ་དང་། གཟུང་བའི་ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱིས་སེམས་མ་བརྙོགས་པ་ཡིན། སེམས་མ་འཁྲུགས་པ་ཡིན།
en: Disturbing emotions resulting from negative speech, harmful talk, adversity, criticism, blaming, cursing, beatings, threats, murder, bondage, and imprisonment did not perturb his mind, which was simply unshakable.

source: བཟོད་པ་དང་དེས་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན།
en: He was perfectly forbearing and gentle.

source: གནོད་པར་མི་སེམས་པ་ཡིན། གནོད་པ་མི་བྱེད་པ་ཡིན། གནོད་སེམས་མེད་པའི་སེམས་དང་ལྡན་པ་ཡིན།
en: He had no harmful wishes, never did any damage, and was utterly free from any ill will.

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པར་བྱ་བའི་བརྩོན་འགྲུས་འབར་བ་བརྩམས་པ་ཡིན།
en: He had given rise to a fervent diligence that was set on helping all other beings.

source: ཡི་དམ་ལ་བརྟེན་པ་ཡིན།
en: It was a firm resolve.

source: དགེ་བའི་ཆོས་ཐམས་ཅད་ཡང་དག་པར་སྒྲུབ་པ་ལ་ཕྱིར་མི་ལྡོག་པ་ཡིན།
en: He could not be turned back from accomplishing all the practices that are the roots of virtue.

source: དྲན་པ་དང་ལྡན་པ་ཡིན། ཤེས་བཞིན་ཅན་ཡིན།
en: He was mindful and composed.

source: ཤིན་ཏུ་མཉམ་པར་བཞག་པ་ཡིན། སེམས་མ་གཡེངས་པ་ཡིན། བསམ་གཏན་ལ་རྩེ་གཅིག་ཏུ་ཡིད་ལ་བྱེད་པ་ཡིན།
en: His mind was not distracted, and he rested one-pointedly in concentration.

source: ཆོས་རབ་ཏུ་རྣམ་པར་འབྱེད་པ་ལ་མཁས་པ་ཡིན།
en: He was skilled in analyzing phenomena.

source: སྣང་བ་ཐོབ་པ་ཡིན། མུན་པ་མུན་གནག་དང་བྲལ་བ་ཡིན།
en: He had found the light, and all darkness had disappeared for him.

source: མི་རྟག་པ་དང་སྡུག་བསྔལ་བ་དང་། བདག་མེད་པ་དང་། མི་སྡུག་པའི་རྣམ་པར་སེམས་ཡོངས་སུ་བསྒོམས་པ་ཡིན།
en: His mind was filled with thoughts about the nature of impermanence, suffering, and repulsiveness.

source: དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཡང་དག་པའི་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ལམ་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཐམས་ཅད་ཤིན་ཏུ་ཡོངས་སུ་སྦྱང་བ་བྱས་པའི་ཡིད་ལ་བྱེད་པ་དང་ལྡན་པ་ཡིན།
en: He was trained in the applications of mindfulness, the thorough relinquishments, the bases of miraculous power, the faculties, the powers, the branches of awakening, the path, the four truths of the noble ones, and all the factors of awakening.

source: ཞི་གནས་དང་ལྷག་མཐོང་གིས་ཤིན་ཏུ་དཀར་བར་བྱས་པའི་བློ་དང་ལྡན་པ་ཡིན།
en: His mind was purified by tranquility and insight.

source: རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བར་ལྟ་བ་ཡིན།
en: He perceived the truth of dependent origination.

source: བདེན་པ་རྗེས་སུ་རྟོགས་པས་གཞན་གྱི་དྲིང་མི་འཇོག་པ་ཡིན།
en: Since he had realized the truth, he was not reliant on others.

source: རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་གྱིས་རྣམ་པར་རྩེ་བ་ཡིན།
en: He mastered the three gateways to liberation.

source: ཆོས་ཐམས་ཅད་ཀྱི་ཚུལ་སྒྱུ་མ་དང་། སྨིག་རྒྱུ་དང་། ཆུ་ཟླ་དང་། བྲག་ཅ་དང་། མིག་ཡོར་ལྟ་བུར་རྟོགས་པ་ཡིན་ནོ།
en: He had realized that all phenomena are like an illusion, a mirage, a dream, a moon reflected in water, an echo, or an optical illusion.

source: །དགེ་སློང་དག་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་དེ་ལྟར་རང་བཞིན་གྱིས་ཆོས་ལ་གནས་པ་ཡིན།
en: Monks, in this way the Bodhisattva lived according to the Dharma.

source: དེ་ལྟར་ཡེ་ཤེས་ལ་གནས་པ་ཡིན།
en: In this way he rested in wisdom.

source: དེ་ལྟར་ཡོན་ཏན་གྱི་ཆེ་བ་ཉིད་ལ་གནས་པ་ཡིན།
en: In this way he rested in a state of immense qualities.

source: དེ་ལྟར་སེམས་ཅན་གྱི་དོན་ལ་བརྩོན་པར་གནས་པ་ཡིན་ཏེ།
en: In this way he strove for the benefit of others.

source: ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱི་བྱིན་གྱིས་བརླབས་པས་སིལ་སྙན་དང་གླུ་དབྱངས་ལས་བྱུང་བའི་ཚིགས་སུ་བཅད་པ་དེ་དག་གིས་རྒྱ་ཆེར་བསྐུལ་བ་དང་། དེའི་ཚེ་སྔོན་གྱི་བྱང་ཆུབ་སེམས་དཔའ་སྲིད་པ་ཐ་མ་པར་གྱུར་པ་རྣམས་ཀྱི་བཙུན་མོའི་འཁོར་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་ཆོས་ཀྱི་སྒོ་བཞི་མངོན་དུ་བྱེད་དོ། །བཞི་གང་ཞེ་ན།
en: Encouraged even more by these verses, which emerged out of the sounds of the instruments through the blessings of the buddhas in the ten directions, the Bodhisattva at this point manifested four Dharma gates in order to mature his retinue of consorts, just as all previous bodhisattvas in their last existence had done. What are these four Dharma gates?

source: འདི་ལྟ་སྟེ། སྦྱིན་པ་དང་། སྙན་པར་སྨྲ་བ་དང་། དོན་བྱ་བ་དང་། དོན་འཐུན་པ་བསྡུ་བའི་དངོས་པོ་བཞི་ལ་སྦྱོར་བ་སྒྲུབ་པ་རྣམ་པར་དག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་མངོན་དུ་བྱེད་པ་དང་། དཀོན་མཆོག་གསུམ་གྱི་རིགས་ཡང་དག་པར་འཛིན་པའི་བསམ་པ་ཆུད་མི་ཟ་བའི་ཐམས་ཅད་མཁྱེན་པའི་སེམས་སྨོན་ལམ་གྱི་སྟོབས་བསྐྱེད་པའི་ཕྱིར་མི་ལྡོག་པའི་ཡུལ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་མངོན་དུ་བྱེད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་མི་གཏང་བའི་ལྷག་པའི་བསམ་པ་སྙིང་རྗེ་ཆེན་པོའི་སྟོབས་ལ་ཞུགས་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་མངོན་དུ་བྱེད་པ་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཐམས་ཅད་ཀྱི་ཚིག་རབ་ཏུ་དབྱེ་བ་དང་། དོན་ལ་རྣམ་པར་ངེས་པའི་ཡེ་ཤེས་ཀྱི་ཚོགས་ཀྱི་སྟོབས་ཀྱི་ཁྱད་པར་ཡང་དག་པར་སྒྲུབ་པ་བཀོད་པ་ཆེན་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་མངོན་དུ་བྱེད་པའོ།
en: The first Dharma gate that he manifested is called pure accomplishment. It refers to the four means of attracting disciples: generosity, kind talk, meaningful actions, and practicing what one preaches. The second Dharma gate that he manifested is called the irreversible state. It produces the power of aspiration toward inexhaustible omniscience, and it ensures that the capacity of the Three Jewels is upheld and not wasted. The third Dharma gate that he manifested is called putting great compassion into practice. It is a disposition of never abandoning any sentient beings. The fourth Dharma gate that he manifested is called the great array. It accomplishes the unique strength of the accumulation of wisdom, which ascertains the meaning of the different categories related to all the factors of awakening.

source: །བྱང་ཆུབ་སེམས་དཔས་ཆོས་ཀྱི་སྒོ་བཞི་པོ་དེ་དག་མངོན་དུ་བྱས་ནས།
en: These are the four Dharma gates that the Bodhisattva manifested.

source: བཙུན་མོའི་འཁོར་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་དེའི་ཚེ།
en: At that point, in order to mature his entire retinue of consorts, he produced many miraculous manifestations.

source: རྣམ་པ་ཇི་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་བྱ་བ་མངོན་པར་འདུས་བྱས་པས་བྱང་ཆུབ་སེམས་དཔའི་མཐུས་སིལ་སྙན་དང་གླུ་དབྱངས་དེ་དག་ལས་ཆོས་ཀྱི་སྒོ་རྣམ་པ་འདི་ལྟ་བུ་བརྒྱ་སྟོང་འབྱུང་བ་དེ་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་བྱ་བ་མངོན་པར་བྱེད་དོ།
en: By the power of the Bodhisattva, these miraculous displays caused hundreds of thousands of Dharma gates to emerge from the sounds of the music, such as the following:

source: །མོས་པ་རྒྱ་ཆེན་དང་ནི་བསམ་པ་དང་། །ལྷག་པའི་བསམ་དང་སྲོག་ཆགས་སྙིང་རྗེ་བས།
en: “Through profound aspirations in one’s heart And the heartfelt compassion for beings,
